cf_billing/Documents/энргУстановитьПараметрыТочекПоставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьПараметрыТочекПоставок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПараметрыТочекПоставки</xr:Item>
				<xr:Item>InformationRegister.энргКатегорииНадежностиТочекПоставок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкиПриема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиПоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяМощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрисоединеннаяМощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СетеваяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктураСети</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньНапряжения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньНапряженияРасчетный</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорТП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыТехнологическогоПрисоединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АктТП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАктыТехнологическогоПрисоединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаПрисоединения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРынка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргВидыРынка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмежныйСубъектОРЭМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитыПСИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПередачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтделениеЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АктРазграниченияБалансовойПринадлежности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАктыРазграниченияБалансовойПринадлежности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапряжениеГБП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КатегорииНадежности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияНадежности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргКатегорииНадежности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВТомЧисле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьПараметрыТочекПоставок/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьРеквизитов();
КонецПроцедуры

#Конецобласти

#Область СобытияШапки

&НаКлиенте
Процедура ТочкиПриемаПриИзменении(Элемент)
	НастроитьВидимостьРеквизитов();
КонецПроцедуры

#Конецобласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимостьРеквизитов()
	Элементы.ГруппаПараметрыТочкиПриема.Видимость = Объект.ТочкиПриема;
КонецПроцедуры

#Конецобласти

#Область События_ТЧ_ТочкиПоставки

&НаКлиенте
Процедура ТочкиПоставкиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.КатегорииНадежности,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("КатегорииНадежности");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#КонецОбласти

#Область События_ТЧ_КатегорииНадежности

&НаКлиенте
Процедура КатегорииНадежностиПриИзменении(Элемент)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 							= Элементы.КатегорииНадежности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

#КонецОбласти
